// Day 1
// 01_두 수의 합

function solution(num1, num2) {
    return num1 + num2;
}



// var answer = -1; 뭘 의미하는지...?
// let answer = 0이랑 같은 의미인지 잘 모르겠네요...


// 테스트 1 〉	통과 (0.02ms, 33.3MB)
// 테스트 2 〉	통과 (0.02ms, 33.3MB)
// 테스트 3 〉	통과 (0.03ms, 33.5MB)
// 테스트 4 〉	통과 (0.04ms, 33.4MB)
// 테스트 5 〉	통과 (0.02ms, 33.3MB)
// 테스트 6 〉	통과 (0.02ms, 33.5MB)
// 테스트 7 〉	통과 (0.03ms, 33.4MB)
// 테스트 8 〉	통과 (0.04ms, 33.4MB)
// 테스트 9 〉	통과 (0.02ms, 33.4MB)
// 테스트 10 〉	통과 (0.02ms, 33.6MB)
// 테스트 11 〉	통과 (0.02ms, 33.5MB)
// 테스트 12 〉	통과 (0.02ms, 33.4MB)
// 테스트 13 〉	통과 (0.03ms, 33.4MB)
// 테스트 14 〉	통과 (0.03ms, 33.4MB)
// 테스트 15 〉	통과 (0.03ms, 33.5MB)
// 테스트 16 〉	통과 (0.04ms, 33.4MB)
// 테스트 17 〉	통과 (0.03ms, 33.5MB)
// 테스트 18 〉	통과 (0.03ms, 33.5MB)