// 정수 num1과 num2가 주어질 때, num1과 num2의 합을 return하도록 soltuion 함수를 완성해주세요.

function solution(num1, num2) {
  const answer = num1 + num2;
  return answer;
}
//다른 사람들 풀이를 보면 제한사항을 넣는게 있던데 제한사항을 넣어서 적용하는법을 모르겠어요 ....

// 테스트 1 〉	통과 (0.03ms, 33.4MB)
// 테스트 2 〉	통과 (0.02ms, 33.5MB)
// 테스트 3 〉	통과 (0.03ms, 33.3MB)
// 테스트 4 〉	통과 (0.02ms, 33.4MB)
// 테스트 5 〉	통과 (0.03ms, 33.4MB)
// 테스트 6 〉	통과 (0.02ms, 33.5MB)
// 테스트 7 〉	통과 (0.02ms, 33.5MB)
// 테스트 8 〉	통과 (0.02ms, 33.4MB)
// 테스트 9 〉	통과 (0.02ms, 33.3MB)
// 테스트 10 〉	통과 (0.02ms, 33.4MB)
// 테스트 11 〉	통과 (0.02ms, 33.4MB)
// 테스트 12 〉	통과 (0.02ms, 33.3MB)
// 테스트 13 〉	통과 (0.02ms, 33.4MB)
// 테스트 14 〉	통과 (0.02ms, 33.4MB)
// 테스트 15 〉	통과 (0.02ms, 33.3MB)
// 테스트 16 〉	통과 (0.02ms, 33.5MB)
// 테스트 17 〉	통과 (0.02ms, 33.4MB)
// 테스트 18 〉	통과 (0.02ms, 33.4MB)
