// 정수 num1, num2가 매개변수 주어집니다. num1과 num2를 곱한 값을 return 하도록 solution 함수를 완성해주세요.

function solution(num1, num2) {
  const answer = num1 * num2;
  return answer;
}

// 테스트 1 〉	통과 (0.02ms, 33MB)
// 테스트 2 〉	통과 (0.02ms, 33.5MB)
// 테스트 3 〉	통과 (0.02ms, 32.9MB)
// 테스트 4 〉	통과 (0.03ms, 33.5MB)
// 테스트 5 〉	통과 (0.02ms, 33.3MB)
// 테스트 6 〉	통과 (0.02ms, 33.5MB)
// 테스트 7 〉	통과 (0.02ms, 33.4MB)
// 테스트 8 〉	통과 (0.02ms, 33.5MB)
// 테스트 9 〉	통과 (0.02ms, 33.4MB)
// 테스트 10 〉	통과 (0.02ms, 33.4MB)
// 테스트 11 〉	통과 (0.02ms, 33.3MB)
// 테스트 12 〉	통과 (0.02ms, 33.5MB)
// 테스트 13 〉	통과 (0.02ms, 33.4MB)
// 테스트 14 〉	통과 (0.02ms, 33.4MB)
// 테스트 15 〉	통과 (0.03ms, 33.4MB)
// 테스트 16 〉	통과 (0.02ms, 33.5MB)
