// DAY 9
// 모스부호 (1)

function solution(letter) {
    morse = { 
    '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'
    }
    
    let newMorse = letter.toString();
    
    return letter.split(" ").map(v => morse[v]).join(""); 
}

/*
테스트 1 〉	통과 (0.11ms, 33.4MB)
테스트 2 〉	통과 (0.10ms, 33.4MB)
테스트 3 〉	통과 (0.12ms, 33.2MB)
테스트 4 〉	통과 (0.10ms, 33.4MB)
테스트 5 〉	통과 (0.10ms, 33.5MB)
테스트 6 〉	통과 (0.11ms, 32.1MB)
테스트 7 〉	통과 (0.12ms, 32.2MB)
*/