// 머쓱이는 40살인 선생님이 몇 년도에 태어났는지 궁금해졌습니다. 나이 age가 주어질 때, 2022년을 기준 출생 연도를 return 하는 solution 함수를 완성해주세요.

function solution(age) {
    return 2022 - age + 1
}

// 테스트 1 〉	통과 (0.02ms, 33.5MB)
// 테스트 2 〉	통과 (0.02ms, 33.5MB)
// 테스트 3 〉	통과 (0.03ms, 33.5MB)
// 테스트 4 〉	통과 (0.03ms, 33.6MB)
// 테스트 5 〉	통과 (0.02ms, 33.6MB)
// 테스트 6 〉	통과 (0.03ms, 33.5MB)
// 테스트 7 〉	통과 (0.03ms, 33.5MB)
// 테스트 8 〉	통과 (0.02ms, 33.5MB)
// 테스트 9 〉	통과 (0.02ms, 33.5MB)
// 테스트 10 〉	통과 (0.02ms, 33.5MB)
// 테스트 11 〉	통과 (0.02ms, 33.5MB)
// 테스트 12 〉	통과 (0.02ms, 33.5MB)